# Brewfile — declarative manifest of tools/casks for this machine.
# Apply with:        brew bundle --file=Brewfile
# Audit drift with:  brew bundle cleanup --file=Brewfile
# See zsh/README.md and main README.md for governance notes.

# ---------------------------------------------------------------------------
# Bootstrap (also referenced from setup.sh)
# ---------------------------------------------------------------------------
brew "git"
brew "gh"
brew "stow"

# ---------------------------------------------------------------------------
# Shell + history
# ---------------------------------------------------------------------------
brew "atuin"

# ---------------------------------------------------------------------------
# Editors
# ---------------------------------------------------------------------------
brew "neovim"
brew "helix"

# ---------------------------------------------------------------------------
# Terminal multiplexers
# ---------------------------------------------------------------------------
brew "tmux"

# ---------------------------------------------------------------------------
# Modern coreutils replacements
# ---------------------------------------------------------------------------
brew "bat"        # cat with syntax highlight
brew "eza"        # ls replacement
brew "ripgrep"    # grep
brew "fd"         # find
brew "fzf"        # fuzzy finder
brew "zoxide"     # smart cd
brew "tree"       # directory viewer
brew "duf"        # df with UI
brew "dust"       # du replacement
brew "btop"       # process/system monitor
brew "tldr"       # short man pages
brew "jq"         # JSON processor
brew "yazi"       # TUI file manager

# ---------------------------------------------------------------------------
# Git tooling
# ---------------------------------------------------------------------------
brew "lazygit"
brew "git-delta" # nicer diffs
brew "jj"        # jujutsu

# ---------------------------------------------------------------------------
# Languages / package managers
# ---------------------------------------------------------------------------
brew "uv"        # fast Python package manager

# ---------------------------------------------------------------------------
# Media / utilities
# ---------------------------------------------------------------------------
brew "ffmpeg"
brew "poppler"
brew "resvg"
brew "sevenzip"

# ---------------------------------------------------------------------------
# Container tooling
# ---------------------------------------------------------------------------
brew "dive"      # explore Docker image layers

# ---------------------------------------------------------------------------
# GUI apps (casks)
# ---------------------------------------------------------------------------
cask "ghostty"
cask "rectangle"
cask "clipy"
cask "hiddenbar"
cask "stats"
cask "keycastr"
cask "visual-studio-code"
cask "zed"
cask "warp"
cask "obsidian"
cask "1password"
cask "devtoys"
cask "kreya"
cask "rustdesk"
cask "hammerspoon"
cask "kindavim"
