# Brewfile — declarative manifest of tools/casks for this machine.
# Apply with:        brew bundle --file=Brewfile
# Audit drift with:  brew bundle cleanup --file=Brewfile
# See zsh/README.md and main README.md for governance notes.

# ---------------------------------------------------------------------------
# Bootstrap (also referenced from setup.sh)
# ---------------------------------------------------------------------------
brew "gh"
brew "stow"

# ---------------------------------------------------------------------------
# Shell + history
# ---------------------------------------------------------------------------
brew "atuin"

# ---------------------------------------------------------------------------
# Editor
# ---------------------------------------------------------------------------
brew "neovim"

# ---------------------------------------------------------------------------
# Terminal multiplexer
# ---------------------------------------------------------------------------
brew "tmux"

# ---------------------------------------------------------------------------
# Modern CLI utilities
# ---------------------------------------------------------------------------
brew "bat"        # cat with syntax highlight
brew "eza"        # ls replacement
brew "ripgrep"    # grep
brew "fd"         # find
brew "fzf"        # fuzzy finder
brew "zoxide"     # smart cd
brew "tree"       # directory viewer
brew "yazi"       # TUI file manager
brew "btop"       # process/system monitor
brew "duf"        # df with UI
brew "dust"       # du replacement
brew "watch"      # run a command periodically

# ---------------------------------------------------------------------------
# Git tooling
# ---------------------------------------------------------------------------
brew "git-delta"  # nicer diffs

# ---------------------------------------------------------------------------
# Markdown / docs
# ---------------------------------------------------------------------------
brew "glow"       # render markdown in terminal

# ---------------------------------------------------------------------------
# Environment management
# ---------------------------------------------------------------------------
brew "direnv"     # per-directory env vars

# ---------------------------------------------------------------------------
# GUI apps (casks)
# ---------------------------------------------------------------------------
cask "ghostty"
cask "clipy"
cask "rectangle"
cask "stats"
cask "keycastr"
cask "obsidian"
cask "kreya"
cask "utm"
cask "obs"
